xdu-aero-association/FM33LC0XX_Example_0.04/USB HID_Mouse/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_rcc.h
/**
  *******************************************************************************************************
  * @file    fm33lc0xx_ll_rcc.h
  * @author  FMSH Application Team
  * @brief   Head file of RCC LL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LC0XX_LL_RCC_H
#define __FM33LC0XX_LL_RCC_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33xx.h"
/** @addtogroup FM33LC0XX_LL_Driver_RCC
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup RCC_LL_ES_INIT RCC Exported Init structures
  * @{
  */

/**
  * @brief LL RCC Init Sturcture definition
  */
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Constants RCC Exported Constants
  * @{
  */
#define    LL_RCC_BUS1_CLOCK_LPTIM                                (0x1U << 0U)
#define    LL_RCC_BUS1_CLOCK_USB                                  (0x1U << 1U)
#define    LL_RCC_BUS1_CLOCK_RTC                                  (0x1U << 2U)
#define    LL_RCC_BUS1_CLOCK_PMU                                  (0x1U << 3U)
#define    LL_RCC_BUS1_CLOCK_SCU                                  (0x1U << 4U)
#define    LL_RCC_BUS1_CLOCK_IWDT                                 (0x1U << 5U)
#define    LL_RCC_BUS1_CLOCK_ANAC                                 (0x1U << 6U)
#define    LL_RCC_BUS1_CLOCK_GPIO                                 (0x1U << 7U)
#define    LL_RCC_BUS1_CLOCK_DCU                                  (0x1U << 31U)
#define    LL_RCC_BUS2_CLOCK_CRC                                  (0x1U << 0U)
#define    LL_RCC_BUS2_CLOCK_RNG                                  (0x1U << 1U)
#define    LL_RCC_BUS2_CLOCK_AES                                  (0x1U << 2U)
#define    LL_RCC_BUS2_CLOCK_LCD                                  (0x1U << 3U)
#define    LL_RCC_BUS2_CLOCK_DMA                                  (0x1U << 4U)
#define    LL_RCC_BUS2_CLOCK_FLASH                                (0x1U << 5U)
#define    LL_RCC_BUS2_CLOCK_RAMBIST                              (0x1U << 6U)
#define    LL_RCC_BUS2_CLOCK_WWDT                                 (0x1U << 7U)
#define    LL_RCC_BUS2_CLOCK_ADC                                  (0x1U << 8U)
#define    LL_RCC_BUS2_CLOCK_HDIV                                 (0x1U << 9U)
#define    LL_RCC_BUS3_CLOCK_SPI1                                 (0x1U << 0U)
#define    LL_RCC_BUS3_CLOCK_SPI2                                 (0x1U << 1U)
#define    LL_RCC_BUS3_CLOCK_UART0                                (0x1U << 8U)
#define    LL_RCC_BUS3_CLOCK_UART1                                (0x1U << 9U)
#define    LL_RCC_BUS3_CLOCK_UART4                                (0x1U << 12U)
#define    LL_RCC_BUS3_CLOCK_UART5                                (0x1U << 13U)
#define    LL_RCC_BUS3_CLOCK_UARTIR                               (0x1U << 14U)
#define    LL_RCC_BUS3_CLOCK_LPUART0                              (0x1U << 15U)
#define    LL_RCC_BUS3_CLOCK_U7816                                (0x1U << 16U)
#define    LL_RCC_BUS3_CLOCK_LPUART1                              (0x1U << 18U)
#define    LL_RCC_BUS3_CLOCK_I2C                                  (0x1U << 24U)
#define    LL_RCC_BUS4_CLOCK_BTIM                                 (0x1U << 0U)
#define    LL_RCC_BUS4_CLOCK_GTIM0                                (0x1U << 2U)
#define    LL_RCC_BUS4_CLOCK_GTIM1                                (0x1U << 3U)
#define    LL_RCC_BUS4_CLOCK_ATIM                                 (0x1U << 4U)
#define    LL_RCC_OPERATION1_CLOCK_EXTI                           (0x1U << 31U)
#define    LL_RCC_OPERATION1_CLOCK_LPUART1                        (0x1U << 29U)
#define    LL_RCC_OPERATION1_CLOCK_LPUART0                        (0x1U << 28U)
#define    LL_RCC_OPERATION1_CLOCK_I2C                            (0x1U << 20U)
#define    LL_RCC_OPERATION1_CLOCK_ATIM                           (0x1U << 15U)
#define    LL_RCC_OPERATION1_CLOCK_UART1                          (0x1U << 9U)
#define    LL_RCC_OPERATION1_CLOCK_UART0                          (0x1U << 8U)
#define    LL_RCC_OPERATION2_CLOCK_USB                            (0x1U << 23U)
#define    LL_RCC_OPERATION2_CLOCK_FLASH_ERASN_PROGRAM            (0x1U << 22U)
#define    LL_RCC_OPERATION2_CLOCK_RNG                            (0x1U << 21U)
#define    LL_RCC_OPERATION2_CLOCK_ADC                            (0x1U << 20U)
#define    LL_RCC_OPERATION2_CLOCK_LPTIM                          (0x1U << 12U)
#define    LL_RCC_OPERATION2_CLOCK_BSTIM                          (0x1U << 4U)
//RESET
#define    LL_RCC_AHB_PERIPHERAL_RST_DMA                          (0x1U << 0U)
#define    LL_RCC_AHB_PERIPHERAL_RST_USB                          (0x1U << 1U)
#define    LL_RCC_APB1_PERIPHERAL_RST_UART5                       (0x1U << 31U)
#define    LL_RCC_APB1_PERIPHERAL_RST_UART4                       (0x1U << 30U)
#define    LL_RCC_APB1_PERIPHERAL_RST_GTTIM1                      (0x1U << 25U)
#define    LL_RCC_APB1_PERIPHERAL_RST_GTTIM0                      (0x1U << 24U)
#define    LL_RCC_APB1_PERIPHERAL_RST_LCD                         (0x1U << 16U)
#define    LL_RCC_APB1_PERIPHERAL_RST_U7816                       (0x1U << 14U)
#define    LL_RCC_APB1_PERIPHERAL_RST_SPI2                        (0x1U << 10U)
#define    LL_RCC_APB1_PERIPHERAL_RST_LPUART0                     (0x1U << 6U)
#define    LL_RCC_APB1_PERIPHERAL_RST_I2C                         (0x1U << 3U)
#define    LL_RCC_APB1_PERIPHERAL_RST_LPTIM                       (0x1U << 0U)
#define    LL_RCC_APB2_PERIPHERAL_RST_ATIM                        (0x1U << 31U)
#define    LL_RCC_APB2_PERIPHERAL_RST_BSTIM                       (0x1U << 28U)
#define    LL_RCC_APB2_PERIPHERAL_RST_ADC_CR                      (0x1U << 24U)
#define    LL_RCC_APB2_PERIPHERAL_RST_ADC                         (0x1U << 23U)
#define    LL_RCC_APB2_PERIPHERAL_RST_OPA                         (0x1U << 22U)
#define    LL_RCC_APB2_PERIPHERAL_RST_HDV                         (0x1U << 19U)
#define    LL_RCC_APB2_PERIPHERAL_RST_AES                         (0x1U << 18U)
#define    LL_RCC_APB2_PERIPHERAL_RST_CRC                         (0x1U << 17U)
#define    LL_RCC_APB2_PERIPHERAL_RST_RNG                         (0x1U << 16U)
#define    LL_RCC_APB2_PERIPHERAL_RST_UART1                       (0x1U << 12U)
#define    LL_RCC_APB2_PERIPHERAL_RST_UART0                       (0x1U << 11U)
#define    LL_RCC_APB2_PERIPHERAL_RST_SPI1                        (0x1U << 9U)
#define    LL_RCC_APB2_PERIPHERAL_RST_UCIR                        (0x1U << 8U)
#define    LL_RCC_APB2_PERIPHERAL_RST_LPUART1                     (0x1U << 7U)

#define    LL_RCC_APB2_DIV_1                                      (0x0U << RCC_SYSCLKCR_APBPRES2_Pos)
#define    LL_RCC_APB2_DIV_2                                      (0x4U << RCC_SYSCLKCR_APBPRES2_Pos)
#define    LL_RCC_APB2_DIV_4                                      (0x5U << RCC_SYSCLKCR_APBPRES2_Pos)
#define    LL_RCC_APB2_DIV_8                                      (0x6U << RCC_SYSCLKCR_APBPRES2_Pos)
#define    LL_RCC_APB2_DIV_16                                     (0x7U << RCC_SYSCLKCR_APBPRES2_Pos)

#define    LL_RCC_APB1_DIV_1                                      (0x0U << RCC_SYSCLKCR_APBPRES1_Pos)
#define    LL_RCC_APB1_DIV_2                                      (0x4U << RCC_SYSCLKCR_APBPRES1_Pos)
#define    LL_RCC_APB1_DIV_4                                      (0x5U << RCC_SYSCLKCR_APBPRES1_Pos)
#define    LL_RCC_APB1_DIV_8                                      (0x6U << RCC_SYSCLKCR_APBPRES1_Pos)
#define    LL_RCC_APB1_DIV_16                                     (0x7U << RCC_SYSCLKCR_APBPRES1_Pos)

#define    LL_RCC_SYSCLK_DIV_1                                    (0x0U << RCC_SYSCLKCR_AHBPRES_Pos)
#define    LL_RCC_SYSCLK_DIV_2                                    (0x4U << RCC_SYSCLKCR_AHBPRES_Pos)
#define    LL_RCC_SYSCLK_DIV_4                                    (0x5U << RCC_SYSCLKCR_AHBPRES_Pos)
#define    LL_RCC_SYSCLK_DIV_8                                    (0x6U << RCC_SYSCLKCR_AHBPRES_Pos)
#define    LL_RCC_SYSCLK_DIV_16                                   (0x7U << RCC_SYSCLKCR_AHBPRES_Pos)

