xdu-aero-association/FM33LC0XX_Example_0.04/USB HID_Mouse/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_rcc.h
#define    LL_RCC_SYSTICK_CLKSOURCE_SCLK                          (0x0U << RCC_SYSCLKCR_STCLKSEL_Pos)
#define    LL_RCC_SYSTICK_CLKSOURCE_LSCLK                         (0x1U << RCC_SYSCLKCR_STCLKSEL_Pos)
#define    LL_RCC_SYSTICK_CLKSOURCE_RC4M                          (0x2U << RCC_SYSCLKCR_STCLKSEL_Pos)
#define    LL_RCC_SYSTICK_CLKSOURCE_SYSCLK                        (0x3U << RCC_SYSCLKCR_STCLKSEL_Pos)

#define    LL_RCC_USB_CLOCK_SELECT_48M                            (0x0U << RCC_SYSCLKCR_BCKOSEL_Pos)
#define    LL_RCC_USB_CLOCK_SELECT_120M                           (0x1U << RCC_SYSCLKCR_BCKOSEL_Pos)

#define    LL_RCC_SYSTEM_CLKSOURCE_RCHF                           (0x0U << RCC_SYSCLKCR_SYSCLKSEL_Pos)
#define    LL_RCC_SYSTEM_CLKSOURCE_XTHF                           (0x1U << RCC_SYSCLKCR_SYSCLKSEL_Pos)
#define    LL_RCC_SYSTEM_CLKSOURCE_PLL                            (0x2U << RCC_SYSCLKCR_SYSCLKSEL_Pos)
#define    LL_RCC_SYSTEM_CLKSOURCE_RC4MPSC                        (0x4U << RCC_SYSCLKCR_SYSCLKSEL_Pos)
#define    LL_RCC_SYSTEM_CLKSOURCE_XTLF                           (0x5U << RCC_SYSCLKCR_SYSCLKSEL_Pos)
#define    LL_RCC_SYSTEM_CLKSOURCE_RCLP                           (0x6U << RCC_SYSCLKCR_SYSCLKSEL_Pos)
#define    LL_RCC_SYSTEM_CLKSOURCE_USBCLK                         (0x7U << RCC_SYSCLKCR_SYSCLKSEL_Pos)

#define    LL_RCC_RCHF_FREQUENCY_8MHZ                             (0x0U << RCC_RCHFCR_FSEL_Pos)
#define    LL_RCC_RCHF_FREQUENCY_16MHZ                            (0x1U << RCC_RCHFCR_FSEL_Pos)
#define    LL_RCC_RCHF_FREQUENCY_24MHZ                            (0x2U << RCC_RCHFCR_FSEL_Pos)

#define    LL_RCC_PLLSOURCE_RCHF                                  (0x0U << RCC_PLLCR_INSEL_Pos)
#define    LL_RCC_PLLSOURCE_XTHF                                  (0x1U << RCC_PLLCR_INSEL_Pos)

#define    LL_RCC_PLL_MUL_MIN                                     (0x1FU)
#define    LL_RCC_PLL_MUL_MAX                                     (0x40U)

#define    LL_RCC_PLLSOURCE_DIV1                                  (0x0U << RCC_PLLCR_REFPRSC_Pos)
#define    LL_RCC_PLLSOURCE_DIV2                                  (0x1U << RCC_PLLCR_REFPRSC_Pos)
#define    LL_RCC_PLLSOURCE_DIV4                                  (0x2U << RCC_PLLCR_REFPRSC_Pos)
#define    LL_RCC_PLLSOURCE_DIV8                                  (0x3U << RCC_PLLCR_REFPRSC_Pos)
#define    LL_RCC_PLLSOURCE_DIV12                                 (0x4U << RCC_PLLCR_REFPRSC_Pos)
#define    LL_RCC_PLLSOURCE_DIV16                                 (0x5U << RCC_PLLCR_REFPRSC_Pos)
#define    LL_RCC_PLLSOURCE_DIV24                                 (0x6U << RCC_PLLCR_REFPRSC_Pos)
#define    LL_RCC_PLLSOURCE_DIV32                                 (0x7U << RCC_PLLCR_REFPRSC_Pos)

#define    LL_RCC_PLL_DIGITAL_DOMAIN_OUTPUT_MUL_1                 (0x0U << RCC_PLLCR_OSEL_Pos)
#define    LL_RCC_PLL_DIGITAL_DOMAIN_OUTPUT_MUL_2                 (0x1U << RCC_PLLCR_OSEL_Pos)

#define    LL_RCC_RCLP_UNDER_SLEEP_OPEN                           (0x0U << RCC_LPOSCCR_LPM_LPO_OFF_Pos)
#define    LL_RCC_RCLP_UNDER_SLEEP_CLOSE                          (0x1U << RCC_LPOSCCR_LPM_LPO_OFF_Pos)

#define    LL_RCC_XTLF_BACKUP_CLOCK_SWITCH_TO_RCLP                (0x5AU << RCC_XTLFCR_BKSW_Pos)
#define    LL_RCC_XTLF_BACKUP_CLOCK_SWITCH_TO_XTLF                (0x0U << RCC_XTLFCR_BKSW_Pos)

#define    LL_RCC_XTLF_FDET_ENABLE                                (0x5U << RCC_XTLFCR_EN_Pos)
#define    LL_RCC_XTLF_FDET_DISABLE                               (0xAU << RCC_XTLFCR_EN_Pos)

#define    LL_RCC_XTLF_CURRENT_SELECT_450NA                       (0x0U << RCC_XTLFCR_IPW_Pos)
#define    LL_RCC_XTLF_CURRENT_SELECT_400NA                       (0x1U << RCC_XTLFCR_IPW_Pos)
#define    LL_RCC_XTLF_CURRENT_SELECT_350NA                       (0x2U << RCC_XTLFCR_IPW_Pos)
#define    LL_RCC_XTLF_CURRENT_SELECT_300NA                       (0x3U << RCC_XTLFCR_IPW_Pos)
#define    LL_RCC_XTLF_CURRENT_SELECT_250NA                       (0x4U << RCC_XTLFCR_IPW_Pos)
#define    LL_RCC_XTLF_CURRENT_SELECT_200NA                       (0x5U << RCC_XTLFCR_IPW_Pos)
#define    LL_RCC_XTLF_CURRENT_SELECT_150NA                       (0x6U << RCC_XTLFCR_IPW_Pos)
#define    LL_RCC_XTLF_CURRENT_SELECT_100NA                       (0x7U << RCC_XTLFCR_IPW_Pos)

#define    LL_RCC_XTHF_OSCILLA_STRENTH_WEAKEST                    (0x0U << RCC_XTHFCR_CFG_Pos)
#define    LL_RCC_XTHF_OSCILLA_STRENTH_STRONGEST                  (0x7U << RCC_XTHFCR_CFG_Pos)

#define    LL_RCC_RC4M_OUTPUT_PRESCALER_DIV1                      (0x0U << RCC_RCMFCR_PSC_Pos)
#define    LL_RCC_RC4M_OUTPUT_PRESCALER_DIV4                      (0x1U << RCC_RCMFCR_PSC_Pos)
#define    LL_RCC_RC4M_OUTPUT_PRESCALER_DIV8                      (0x2U << RCC_RCMFCR_PSC_Pos)
#define    LL_RCC_RC4M_OUTPUT_PRESCALER_DIV16                     (0x3U << RCC_RCMFCR_PSC_Pos)

#define    LL_RCC_EXTERNAL_INTERRUPT_SAMPLING_CLOCK_SELECT_LSCLK  (0x1U << RCC_OPCCR1_EXTICKS_Pos)
#define    LL_RCC_EXTERNAL_INTERRUPT_SAMPLING_CLOCK_SELECT_HCLK   (0x0U << RCC_OPCCR1_EXTICKS_Pos)

#define    LL_RCC_LPUART_OPERTION_CLOCK_SOURCE_LSCLK              (0x0U)
#define    LL_RCC_LPUART_OPERTION_CLOCK_SOURCE_RCHF               (0x1U)
#define    LL_RCC_LPUART_OPERTION_CLOCK_SOURCE_RC4M               (0x2U)


#define    LL_RCC_BEEP_OPERATION_CLOCK_SOURCE_XTLF                (0x0U << RCC_OPCCR1_BEEPCKS_Pos)
#define    LL_RCC_BEEP_OPERATION_CLOCK_SOURCE_RCLP                (0x1U << RCC_OPCCR1_BEEPCKS_Pos)

#define    LL_RCC_I2C_OPERATION_CLOCK_SOURCE_APBCLK1              (0x0U << RCC_OPCCR1_I2CCKS_Pos)
#define    LL_RCC_I2C_OPERATION_CLOCK_SOURCE_RCHF                 (0x1U << RCC_OPCCR1_I2CCKS_Pos)
#define    LL_RCC_I2C_OPERATION_CLOCK_SOURCE_SYSCLK               (0x2U << RCC_OPCCR1_I2CCKS_Pos)
#define    LL_RCC_I2C_OPERATION_CLOCK_SOURCE_RC4M_PSC             (0x3U << RCC_OPCCR1_I2CCKS_Pos)

#define    LL_RCC_ATIME_OPERATION_CLOCK_SOURCE_APBCLK2            (0x0U << RCC_OPCCR1_ATCKS_Pos)
#define    LL_RCC_ATIME_OPERATION_CLOCK_SOURCE_USBPHYBCK120M      (0x1U << RCC_OPCCR1_ATCKS_Pos)
#define    LL_RCC_ATIME_OPERATION_CLOCK_SOURCE_PLLx2              (0x3U << RCC_OPCCR1_ATCKS_Pos)

#define    LL_RCC_UART_OPERATION_CLOCK_SOURCE_APBCLK1             (0x0U)
#define    LL_RCC_UART_OPERATION_CLOCK_SOURCE_RCHF                (0x1U)
#define    LL_RCC_UART_OPERATION_CLOCK_SOURCE_SYSCLK              (0x3U)
#define    LL_RCC_UART_OPERATION_CLOCK_SOURCE_RC4M_PSC            (0x4U)

#define    LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV1              (0x0U << RCC_OPCCR2_RNGPRSC_Pos)
#define    LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV2              (0x1U << RCC_OPCCR2_RNGPRSC_Pos)
#define    LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV4              (0x2U << RCC_OPCCR2_RNGPRSC_Pos)
#define    LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV8              (0x3U << RCC_OPCCR2_RNGPRSC_Pos)
#define    LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV16             (0x4U << RCC_OPCCR2_RNGPRSC_Pos)
#define    LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV32             (0x5U << RCC_OPCCR2_RNGPRSC_Pos)

#define    LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV1              (0x0U << RCC_OPCCR2_ADCPRSC_Pos)
#define    LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV2              (0x1U << RCC_OPCCR2_ADCPRSC_Pos)
#define    LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV4              (0x2U << RCC_OPCCR2_ADCPRSC_Pos)
#define    LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV8              (0x3U << RCC_OPCCR2_ADCPRSC_Pos)
#define    LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV16             (0x4U << RCC_OPCCR2_ADCPRSC_Pos)
#define    LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV32             (0x5U << RCC_OPCCR2_ADCPRSC_Pos)

#define    LL_RCC_USB_OPERATION_CLOCK_PRESCALLER_XTLF             (0x0U << RCC_OPCCR2_USBCKS_Pos)
#define    LL_RCC_USB_OPERATION_CLOCK_PRESCALLER_XTHF             (0x1U << RCC_OPCCR2_USBCKS_Pos)

#define    LL_RCC_ADC_OPERATION_CLOCK_PRESCALLER_RC4M_PSC         (0x0U << RCC_OPCCR2_ADCCKS_Pos)
#define    LL_RCC_ADC_OPERATION_CLOCK_PRESCALLER_RCHF             (0x1U << RCC_OPCCR2_ADCCKS_Pos)
#define    LL_RCC_ADC_OPERATION_CLOCK_PRESCALLER_XTHF             (0x2U << RCC_OPCCR2_ADCCKS_Pos)
#define    LL_RCC_ADC_OPERATION_CLOCK_PRESCALLER_PLL              (0x3U << RCC_OPCCR2_ADCCKS_Pos)

#define    LL_RCC_LPTIM_OPERATION_CLOCK_SOURCE_APBCLK1            (0x0U << RCC_OPCCR2_LPTCKS_Pos)
#define    LL_RCC_LPTIM_OPERATION_CLOCK_SOURCE_LSCLK              (0x1U << RCC_OPCCR2_LPTCKS_Pos)
#define    LL_RCC_LPTIM_OPERATION_CLOCK_SOURCE_RCLP               (0x2U << RCC_OPCCR2_LPTCKS_Pos)
#define    LL_RCC_LPTIM_OPERATION_CLOCK_SOURCE_RC4M_PSC           (0x3U << RCC_OPCCR2_LPTCKS_Pos)

#define    LL_RCC_BSTIM_OPERATION_CLK_SOURCE_APBCLK2              (0x0U << RCC_OPCCR2_BTCKS_Pos)
#define    LL_RCC_BSTIM_OPERATION_CLK_SOURCE_LSCLK                (0x1U << RCC_OPCCR2_BTCKS_Pos)
#define    LL_RCC_BSTIM_OPERATION_CLK_SOURCE_RCLP                 (0x2U << RCC_OPCCR2_BTCKS_Pos)
#define    LL_RCC_BSTIM_OPERATION_CLK_SOURCE_RC4M_PSC             (0x3U << RCC_OPCCR2_BTCKS_Pos)

#define    LL_RCC_AHB_MASTER_PRIORITY_DMA_FIRST                   (0x0U << RCC_AHBMCR_MPRIL_Pos)
#define    LL_RCC_AHB_MASTER_PRIORITY_CPU_FIRST                   (0x1U << RCC_AHBMCR_MPRIL_Pos)

#define    LL_RCC_LSCLK_SELECT_RCLP                               (0x55U << RCC_LSCLKSEL_SEL_Pos)
#define    LL_RCC_LSCLK_SELECT_XTLF                               (0xAAU << RCC_LSCLKSEL_SEL_Pos)

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Functions RCC Exported Functions
  * @{
  */

/**
  * @brief    
  * @rmtoll   IER    HFDET_IE    LL_RCC_EnableIT_XTHF_Fail
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_EnableIT_XTHF_Fail(void)
{
    SET_BIT(FDET->IER, FDET_IER_HFDET_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    HFDET_IE    LL_RCC_IsEnabledIT_XTHF_Fail
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_XTHF_Fail(void)
{
    return (uint32_t)(READ_BIT(FDET->IER, FDET_IER_HFDET_IE_Msk) == FDET_IER_HFDET_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    HFDET_IE    LL_RCC_DisableIT_XTHF_Fail
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_DisableIT_XTHF_Fail(void)
{
    CLEAR_BIT(FDET->IER, FDET_IER_HFDET_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    LFDET_IE    LL_RCC_EnableIT_XTLF_Fail
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_EnableIT_XTLF_Fail(void)
{
    SET_BIT(FDET->IER, FDET_IER_LFDET_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    LFDET_IE    LL_RCC_IsEnabledIT_XTLF_Fail
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_XTLF_Fail(void)
{
    return (uint32_t)(READ_BIT(FDET->IER, FDET_IER_LFDET_IE_Msk) == FDET_IER_LFDET_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    LFDET_IE    LL_RCC_DisableIT_XTLF_Fail
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_DisableIT_XTLF_Fail(void)
{
    CLEAR_BIT(FDET->IER, FDET_IER_LFDET_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    HFDETO    LL_RCC_IsActiveFlag_XTHF_Vibrating
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_XTHF_Vibrating(void)
{
    return (uint32_t)(READ_BIT(FDET->ISR, FDET_ISR_HFDETO_Msk) == (FDET_ISR_HFDETO_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    LFDETO    LL_RCC_IsActiveFlag_XTLF_Vibrating
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_XTLF_Vibrating(void)
{
    return (uint32_t)(READ_BIT(FDET->ISR, FDET_ISR_LFDETO_Msk) == (FDET_ISR_LFDETO_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    HFDETIF    LL_RCC_IsActiveFlag_XTHF_Fail
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_XTHF_Fail(void)
{
    return (uint32_t)(READ_BIT(FDET->ISR, FDET_ISR_HFDETIF_Msk) == (FDET_ISR_HFDETIF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    HFDETIF    LL_RCC_ClearFlag_XTHF_Fail
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_XTHF_Fail(void)
{
    WRITE_REG(FDET->ISR, FDET_ISR_HFDETIF_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    LFDETIF    LL_RCC_IsActiveFlag_XTLF_Fail
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_XTLF_Fail(void)
{
    return (uint32_t)(READ_BIT(FDET->ISR, FDET_ISR_LFDETIF_Msk) == (FDET_ISR_LFDETIF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    LFDETIF    LL_RCC_ClearFlag_XTLF_Fail
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_XTLF_Fail(void)
{
    WRITE_REG(FDET->ISR, FDET_ISR_LFDETIF_Msk);
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    LSCATS    LL_RCC_Enable_LSCLK_AutoSwitch
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Enable_LSCLK_AutoSwitch(void)
{
    SET_BIT(RCC->SYSCLKCR, RCC_SYSCLKCR_LSCATS_Msk);
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    LSCATS    LL_RCC_IsEnabled_LSCLK_AutoSwitch
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabled_LSCLK_AutoSwitch(void)
{
    return (uint32_t)(READ_BIT(RCC->SYSCLKCR, RCC_SYSCLKCR_LSCATS_Msk) == RCC_SYSCLKCR_LSCATS_Msk);
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    LSCATS    LL_RCC_Disable_LSCLK_AutoSwitch
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Disable_LSCLK_AutoSwitch(void)
{
    CLEAR_BIT(RCC->SYSCLKCR, RCC_SYSCLKCR_LSCATS_Msk);
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    SLP_ENEXTI    LL_RCC_Enable_SleepmodeExternalInterrupt
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Enable_SleepmodeExternalInterrupt(void)
{
    SET_BIT(RCC->SYSCLKCR, RCC_SYSCLKCR_SLP_ENEXTI_Msk);
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    SLP_ENEXTI    LL_RCC_IsEnabled_SleepmodeExternalInterrupt
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabled_SleepmodeExternalInterrupt(void)
{
    return (uint32_t)(READ_BIT(RCC->SYSCLKCR, RCC_SYSCLKCR_SLP_ENEXTI_Msk) == RCC_SYSCLKCR_SLP_ENEXTI_Msk);
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    SLP_ENEXTI    LL_RCC_Disable_SleepmodeExternalInterrupt
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Disable_SleepmodeExternalInterrupt(void)
{
    CLEAR_BIT(RCC->SYSCLKCR, RCC_SYSCLKCR_SLP_ENEXTI_Msk);
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    APBPRES2    LL_RCC_SetAPB2Prescaler
  * @param    Prescaler This parameter can be one of the following values:
  *           @arg @ref LL_RCC_APB2_DIV_1
  *           @arg @ref LL_RCC_APB2_DIV_2
  *           @arg @ref LL_RCC_APB2_DIV_4
  *           @arg @ref LL_RCC_APB2_DIV_8
  *           @arg @ref LL_RCC_APB2_DIV_16
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetAPB2Prescaler(uint32_t Prescaler)
{
    MODIFY_REG(RCC->SYSCLKCR, RCC_SYSCLKCR_APBPRES2_Msk, Prescaler);
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    APBPRES2    LL_RCC_GetAPB2Prescaler
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_APB2_DIV_1
  *           @arg @ref LL_RCC_APB2_DIV_2
  *           @arg @ref LL_RCC_APB2_DIV_4
  *           @arg @ref LL_RCC_APB2_DIV_8
  *           @arg @ref LL_RCC_APB2_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB2Prescaler(void)
{
    return (uint32_t)(READ_BIT(RCC->SYSCLKCR, RCC_SYSCLKCR_APBPRES2_Msk));
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    APBPRES1    LL_RCC_SetAPB1Prescaler
  * @param    Prescaler This parameter can be one of the following values:
  *           @arg @ref LL_RCC_APB1_DIV_1
  *           @arg @ref LL_RCC_APB1_DIV_2
  *           @arg @ref LL_RCC_APB1_DIV_4
  *           @arg @ref LL_RCC_APB1_DIV_8
  *           @arg @ref LL_RCC_APB1_DIV_16
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetAPB1Prescaler(uint32_t Prescaler)
{
    MODIFY_REG(RCC->SYSCLKCR, RCC_SYSCLKCR_APBPRES1_Msk, Prescaler);
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    APBPRES1    LL_RCC_GetAPB1Prescaler
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_APB1_DIV_1
  *           @arg @ref LL_RCC_APB1_DIV_2
  *           @arg @ref LL_RCC_APB1_DIV_4
  *           @arg @ref LL_RCC_APB1_DIV_8
  *           @arg @ref LL_RCC_APB1_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB1Prescaler(void)
{
    return (uint32_t)(READ_BIT(RCC->SYSCLKCR, RCC_SYSCLKCR_APBPRES1_Msk));
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    AHBPRES    LL_RCC_SetAHBPrescaler
  * @param    Prescaler This parameter can be one of the following values:
  *           @arg @ref LL_RCC_SYSCLK_DIV_1
  *           @arg @ref LL_RCC_SYSCLK_DIV_2
  *           @arg @ref LL_RCC_SYSCLK_DIV_4
  *           @arg @ref LL_RCC_SYSCLK_DIV_8
  *           @arg @ref LL_RCC_SYSCLK_DIV_16
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetAHBPrescaler(uint32_t Prescaler)
{
    MODIFY_REG(RCC->SYSCLKCR, RCC_SYSCLKCR_AHBPRES_Msk, Prescaler);
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    AHBPRES    LL_RCC_GetAHBPrescaler
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_SYSCLK_DIV_1
  *           @arg @ref LL_RCC_SYSCLK_DIV_2
  *           @arg @ref LL_RCC_SYSCLK_DIV_4
  *           @arg @ref LL_RCC_SYSCLK_DIV_8
  *           @arg @ref LL_RCC_SYSCLK_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAHBPrescaler(void)
{
    return (uint32_t)(READ_BIT(RCC->SYSCLKCR, RCC_SYSCLKCR_AHBPRES_Msk));
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    STCLKSEL    LL_RCC_SetSystickClockSource
  * @param    SystickSource This parameter can be one of the following values:
  *           @arg @ref LL_RCC_SYSTICK_CLKSOURCE_SCLK
  *           @arg @ref LL_RCC_SYSTICK_CLKSOURCE_LSCLK
  *           @arg @ref LL_RCC_SYSTICK_CLKSOURCE_RC4M
  *           @arg @ref LL_RCC_SYSTICK_CLKSOURCE_SYSCLK
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetSystickClockSource(uint32_t SystickSource)
{
    MODIFY_REG(RCC->SYSCLKCR, RCC_SYSCLKCR_STCLKSEL_Msk, SystickSource);
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    STCLKSEL    LL_RCC_GetSystickClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_SYSTICK_CLKSOURCE_SCLK
  *           @arg @ref LL_RCC_SYSTICK_CLKSOURCE_LSCLK
  *           @arg @ref LL_RCC_SYSTICK_CLKSOURCE_RC4M
  *           @arg @ref LL_RCC_SYSTICK_CLKSOURCE_SYSCLK
  */
__STATIC_INLINE uint32_t LL_RCC_GetSystickClockSource(void)
{
    return (uint32_t)(READ_BIT(RCC->SYSCLKCR, RCC_SYSCLKCR_STCLKSEL_Msk));
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    BCKOSEL    LL_RCC_SetUSBClockSource
  * @param    Source This parameter can be one of the following values:
  *           @arg @ref LL_RCC_USB_CLOCK_SELECT_48M
  *           @arg @ref LL_RCC_USB_CLOCK_SELECT_120M
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetUSBClockSource(uint32_t Source)
{
    MODIFY_REG(RCC->SYSCLKCR, RCC_SYSCLKCR_BCKOSEL_Msk, Source);
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    BCKOSEL    LL_RCC_GetUSBClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_USB_CLOCK_SELECT_48M
  *           @arg @ref LL_RCC_USB_CLOCK_SELECT_120M
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSBClockSource(void)
{
    return (uint32_t)(READ_BIT(RCC->SYSCLKCR, RCC_SYSCLKCR_BCKOSEL_Msk));
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    SYSCLKSEL    LL_RCC_SetSystemClockSource
  * @param    SystickSource This parameter can be one of the following values:
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_RCHF
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_XTHF
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_PLL
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_RC4MPSC
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_XTLF
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_RCLP
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_USBCLK
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetSystemClockSource(uint32_t SystickSource)
{
    MODIFY_REG(RCC->SYSCLKCR, RCC_SYSCLKCR_SYSCLKSEL_Msk, SystickSource);
}

/**
  * @brief    
  * @rmtoll   SYSCLKCR    SYSCLKSEL    LL_RCC_GetSystemClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_RCHF
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_XTHF
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_PLL
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_RC4MPSC
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_XTLF
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_RCLP
  *           @arg @ref LL_RCC_SYSTEM_CLKSOURCE_USBCLK
  */
__STATIC_INLINE uint32_t LL_RCC_GetSystemClockSource(void)
{
    return (uint32_t)(READ_BIT(RCC->SYSCLKCR, RCC_SYSCLKCR_SYSCLKSEL_Msk));
}

/**
  * @brief    
  * @rmtoll   RCHFCR    FSEL    LL_RCC_SetRCHFFrequency
  * @param    Freq This parameter can be one of the following values:
  *           @arg @ref LL_RCC_RCHF_FREQUENCY_8MHZ
  *           @arg @ref LL_RCC_RCHF_FREQUENCY_16MHZ
  *           @arg @ref LL_RCC_RCHF_FREQUENCY_24MHZ
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetRCHFFrequency(uint32_t Freq)
{
    MODIFY_REG(RCC->RCHFCR, RCC_RCHFCR_FSEL_Msk, Freq);
}

/**
  * @brief    
  * @rmtoll   RCHFCR    FSEL    LL_RCC_GetRCHFFrequency
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_RCHF_FREQUENCY_8MHZ
  *           @arg @ref LL_RCC_RCHF_FREQUENCY_16MHZ
  *           @arg @ref LL_RCC_RCHF_FREQUENCY_24MHZ
  */
__STATIC_INLINE uint32_t LL_RCC_GetRCHFFrequency(void)
{
    return (uint32_t)(READ_BIT(RCC->RCHFCR, RCC_RCHFCR_FSEL_Msk));
}

/**
  * @brief    
  * @rmtoll   RCHFCR    EN    LL_RCC_Enable_RCHF
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Enable_RCHF(void)
{
    SET_BIT(RCC->RCHFCR, RCC_RCHFCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   RCHFCR    EN    LL_RCC_IsEnabled_RCHF
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabled_RCHF(void)
{
    return (uint32_t)(READ_BIT(RCC->RCHFCR, RCC_RCHFCR_EN_Msk) == RCC_RCHFCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   RCHFCR    EN    LL_RCC_Disable_RCHF
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Disable_RCHF(void)
{
    CLEAR_BIT(RCC->RCHFCR, RCC_RCHFCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   RCMFTR    TRIM    LL_RCC_SetRC4MTrimValue
  * @param    TrimValue TrimValue The value of RC4M trim
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetRC4MTrimValue(uint32_t TrimValue)
{
    MODIFY_REG(RCC->RCMFTR, (0x7FU << 0U), (TrimValue << 0U));
}

/**
  * @brief    
  * @rmtoll   RCMFTR    TRIM    LL_RCC_GetRC4MTrimValue
  * @retval   The Value of RC4M trim
  */
__STATIC_INLINE uint32_t LL_RCC_GetRC4MTrimValue(void)
{
    return (uint32_t)(READ_BIT(RCC->RCMFTR, 0x7FU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   PLLCR    EN    LL_RCC_PLL_Enable
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_PLL_Enable(void)
{
    SET_BIT(RCC->PLLCR, RCC_PLLCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   PLLCR    EN    LL_RCC_PLL_Disable
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_PLL_Disable(void)
{
    CLEAR_BIT(RCC->PLLCR, RCC_PLLCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   PLLCR    EN    LL_RCC_PLL_IsEnabled
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_IsEnabled(void)
{
    return (uint32_t)(READ_BIT(RCC->PLLCR, RCC_PLLCR_EN_Msk) == RCC_PLLCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   PLLCR    LOCKED    LL_RCC_PLL_IsReady
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_IsReady(void)
{
    return (uint32_t)(READ_BIT(RCC->PLLCR, RCC_PLLCR_LOCKED_Msk) == (RCC_PLLCR_LOCKED_Msk));
}

/**
  * @brief    
  * @rmtoll   PLLCR    INSEL    LL_RCC_SetPLLSource
  * @param    PllSource This parameter can be one of the following values:
  *           @arg @ref LL_RCC_PLLSOURCE_RCHF
  *           @arg @ref LL_RCC_PLLSOURCE_XTHF
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetPLLSource(uint32_t PllSource)
{
    MODIFY_REG(RCC->PLLCR, RCC_PLLCR_INSEL_Msk, PllSource);
}

