xdu-aero-association/FM33LC0XX_Example_0.04/USB HID_Mouse/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_rcc.h
/**
  * @brief    
  * @rmtoll   PLLCR    INSEL    LL_RCC_GetPLLSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_PLLSOURCE_RCHF
  *           @arg @ref LL_RCC_PLLSOURCE_XTHF
  */
__STATIC_INLINE uint32_t LL_RCC_GetPLLSource(void)
{
    return (uint32_t)(READ_BIT(RCC->PLLCR, RCC_PLLCR_INSEL_Msk));
}

/**
  * @brief    
  * @rmtoll   PLLCR    DB    LL_RCC_SetPLLMultiplier
  * @param    PLLMul This parameter can be Between parameters of the following values:
  *           @arg @ref LL_RCC_PLL_MUL_MIN
  *           @arg @ref LL_RCC_PLL_MUL_MAX
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetPLLMultiplier(uint32_t PLLMul)
{
    MODIFY_REG(RCC->PLLCR, RCC_PLLCR_DB_Msk, PLLMul << RCC_PLLCR_DB_Pos);
}

/**
  * @brief    
  * @rmtoll   PLLCR    DB    LL_RCC_GetPLLMultiplier
  * @retval   Returned value can be Between parameters of the following values:
  *           @arg @ref LL_RCC_PLL_MUL_MIN
  *           @arg @ref LL_RCC_PLL_MUL_MAX
  */
__STATIC_INLINE uint32_t LL_RCC_GetPLLMultiplier(void)
{
    return (uint32_t)(READ_BIT(RCC->PLLCR, RCC_PLLCR_DB_Msk) >> RCC_PLLCR_DB_Pos);
}

/**
  * @brief    
  * @rmtoll   PLLCR    REFPRSC    LL_RCC_SetPLLPrescaler
  * @param    PLLDiv This parameter can be one of the following values:
  *           @arg @ref LL_RCC_PLLSOURCE_DIV1
  *           @arg @ref LL_RCC_PLLSOURCE_DIV2
  *           @arg @ref LL_RCC_PLLSOURCE_DIV4
  *           @arg @ref LL_RCC_PLLSOURCE_DIV8
  *           @arg @ref LL_RCC_PLLSOURCE_DIV12
  *           @arg @ref LL_RCC_PLLSOURCE_DIV16
  *           @arg @ref LL_RCC_PLLSOURCE_DIV24
  *           @arg @ref LL_RCC_PLLSOURCE_DIV32
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetPLLPrescaler(uint32_t PLLDiv)
{
    MODIFY_REG(RCC->PLLCR, RCC_PLLCR_REFPRSC_Msk, PLLDiv);
}

/**
  * @brief    
  * @rmtoll   PLLCR    REFPRSC    LL_RCC_GetPLLPrescaler
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_PLLSOURCE_DIV1
  *           @arg @ref LL_RCC_PLLSOURCE_DIV2
  *           @arg @ref LL_RCC_PLLSOURCE_DIV4
  *           @arg @ref LL_RCC_PLLSOURCE_DIV8
  *           @arg @ref LL_RCC_PLLSOURCE_DIV12
  *           @arg @ref LL_RCC_PLLSOURCE_DIV16
  *           @arg @ref LL_RCC_PLLSOURCE_DIV24
  *           @arg @ref LL_RCC_PLLSOURCE_DIV32
  */
__STATIC_INLINE uint32_t LL_RCC_GetPLLPrescaler(void)
{
    return (uint32_t)(READ_BIT(RCC->PLLCR, RCC_PLLCR_REFPRSC_Msk));
}

/**
  * @brief    
  * @rmtoll   PLLCR    OSEL    LL_RCC_SetPLLDigitalDomainOutput
  * @param    DigitalDomainOutput This parameter can be one of the following values:
  *           @arg @ref LL_RCC_PLL_DIGITAL_DOMAIN_OUTPUT_MUL_1
  *           @arg @ref LL_RCC_PLL_DIGITAL_DOMAIN_OUTPUT_MUL_2
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetPLLDigitalDomainOutput(uint32_t DigitalDomainOutput)
{
    MODIFY_REG(RCC->PLLCR, RCC_PLLCR_OSEL_Msk, DigitalDomainOutput);
}

/**
  * @brief    
  * @rmtoll   PLLCR    OSEL    LL_RCC_GetPLLDigitalDomainOutput
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_PLL_DIGITAL_DOMAIN_OUTPUT_MUL_1
  *           @arg @ref LL_RCC_PLL_DIGITAL_DOMAIN_OUTPUT_MUL_2
  */
__STATIC_INLINE uint32_t LL_RCC_GetPLLDigitalDomainOutput(void)
{
    return (uint32_t)(READ_BIT(RCC->PLLCR, RCC_PLLCR_OSEL_Msk));
}

/**
  * @brief    
  * @rmtoll   PLLCR    OSEL    LL_RCC_GetPLLDigitalDomainOutput
  * @param    Source This parameter can be one of the following values:
  *           @arg @ref LL_RCC_PLLSOURCE_RCHF
  *           @arg @ref LL_RCC_PLLSOURCE_XTHF
  * @param    PLL_R This parameter can be one of the following values:
  *           @arg @ref LL_RCC_PLLSOURCE_DIV1
  *           @arg @ref LL_RCC_PLLSOURCE_DIV2
  *           @arg @ref LL_RCC_PLLSOURCE_DIV4
  *           @arg @ref LL_RCC_PLLSOURCE_DIV8
  *           @arg @ref LL_RCC_PLLSOURCE_DIV12
  *           @arg @ref LL_RCC_PLLSOURCE_DIV16
  *           @arg @ref LL_RCC_PLLSOURCE_DIV24
  *           @arg @ref LL_RCC_PLLSOURCE_DIV32
  * @param    PLL_DB This parameter can be Between parameters of the following values:
  *           @arg @ref LL_RCC_PLL_MUL_MIN
  *           @arg @ref LL_RCC_PLL_MUL_MAX

  * @param    PLL_O This parameter can be one of the following values:
  *           @arg @ref LL_RCC_PLL_DIGITAL_DOMAIN_OUTPUT_MUL_1
  *           @arg @ref LL_RCC_PLL_DIGITAL_DOMAIN_OUTPUT_MUL_2
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_PLL_ConfigDomain_SYS(uint32_t Source, uint32_t PLL_R, uint32_t PLL_DB, uint32_t PLL_O)
{
  MODIFY_REG(RCC->PLLCR, RCC_PLLCR_DB_Msk | RCC_PLLCR_REFPRSC_Msk | RCC_PLLCR_OSEL_Msk | RCC_PLLCR_INSEL_Msk,
             (PLL_DB << RCC_PLLCR_DB_Pos) | PLL_R | PLL_O | Source);
}

/**
  * @brief    
  * @rmtoll   LPOSCCR    LPOENB    LL_RCC_IsActiveFlag_RCLP_Enable
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_RCLP_Enable(void)
{
    return (uint32_t)(READ_BIT(RCC->LPOSCCR, RCC_LPOSCCR_LPOENB_Msk) == (RCC_LPOSCCR_LPOENB_Msk));
}

/**
  * @brief    
  * @rmtoll   LPOSCCR    LPM_LPO_OFF    LL_RCC_SetSleepModeRCLPWorkMode
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref LL_RCC_RCLP_UNDER_SLEEP_OPEN
  *           @arg @ref LL_RCC_RCLP_UNDER_SLEEP_CLOSE
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetSleepModeRCLPWorkMode(uint32_t mode)
{
    MODIFY_REG(RCC->LPOSCCR, RCC_LPOSCCR_LPM_LPO_OFF_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   LPOSCCR    LPM_LPO_OFF    LL_RCC_GetSleepModeRCLPWorkMode
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_RCLP_UNDER_SLEEP_OPEN
  *           @arg @ref LL_RCC_RCLP_UNDER_SLEEP_CLOSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSleepModeRCLPWorkMode(void)
{
    return (uint32_t)(READ_BIT(RCC->LPOSCCR, RCC_LPOSCCR_LPM_LPO_OFF_Msk));
}

/**
  * @brief    
  * @rmtoll   LPOSCCR    LPO_CHOP_EN    LL_RCC_Enabled_RCLPChopper
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Enabled_RCLPChopper(void)
{
    SET_BIT(RCC->LPOSCCR, RCC_LPOSCCR_LPO_CHOP_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   LPOSCCR    LPO_CHOP_EN    LL_RCC_IsEnabled_RCLPChopper
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabled_RCLPChopper(void)
{
    return (uint32_t)(READ_BIT(RCC->LPOSCCR, RCC_LPOSCCR_LPO_CHOP_EN_Msk) == RCC_LPOSCCR_LPO_CHOP_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   LPOSCCR    LPO_CHOP_EN    LL_RCC_Disabled_RCLPChopper
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Disabled_RCLPChopper(void)
{
    CLEAR_BIT(RCC->LPOSCCR, RCC_LPOSCCR_LPO_CHOP_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   LPOSCTR    TRIM    LL_RCC_SetRCLPTRIM
  * @param    TrimValue TrimValue The value of RCLP trim
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetRCLPTRIM(uint32_t TrimValue)
{
    MODIFY_REG(RCC->LPOSCTR, (0xFFU << 0U), (TrimValue << 0U));
}

/**
  * @brief    
  * @rmtoll   LPOSCTR    TRIM    LL_RCC_GetRCLPTRIM
  * @retval   The Value of RCLP trim
  */
__STATIC_INLINE uint32_t LL_RCC_GetRCLPTRIM(void)
{
    return (uint32_t)(READ_BIT(RCC->LPOSCTR, 0xFFU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   XTLFCR    EN    LL_RCC_Enable_XTLF
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Enable_XTLF(void)
{
    MODIFY_REG(RCC->XTLFCR, RCC_XTLFCR_EN_Msk, LL_RCC_XTLF_FDET_ENABLE);
}

/**
  * @brief    
  * @rmtoll   XTLFCR    EN    LL_RCC_Disable_XTLF
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Disable_XTLF(void)
{ 
    MODIFY_REG(RCC->XTLFCR, RCC_XTLFCR_EN_Msk, LL_RCC_XTLF_FDET_DISABLE);
}
/**
  * @brief    
  * @rmtoll   XTLFCR    IPW    LL_RCC_SetXTLFCurrent
  * @param    CurrentValue This parameter can be one of the following values:
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_450NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_400NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_350NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_300NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_250NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_200NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_150NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_100NA
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetXTLFCurrent(uint32_t CurrentValue)
{
    MODIFY_REG(RCC->XTLFCR, RCC_XTLFCR_IPW_Msk, CurrentValue);
}

/**
  * @brief    
  * @rmtoll   XTLFCR    IPW    LL_RCC_GetXTLFCurrent
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_450NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_400NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_350NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_300NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_250NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_200NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_150NA
  *           @arg @ref LL_RCC_XTLF_CURRENT_SELECT_100NA
  */
__STATIC_INLINE uint32_t LL_RCC_GetXTLFCurrent(void)
{
    return (uint32_t)(READ_BIT(RCC->XTLFCR, RCC_XTLFCR_IPW_Msk));
}

/**
  * @brief    
  * @rmtoll   XTHFCR    CFG    LL_RCC_SetXTHFOscilaStrenth
  * @param    OscilaStrenth This parameter can be one of the following values:
  *           @arg @ref LL_RCC_XTHF_OSCILLA_STRENTH_WEAKEST
  *           @arg @ref LL_RCC_XTHF_OSCILLA_STRENTH_STRONGEST
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetXTHFOscilaStrenth(uint32_t OscilaStrenth)
{
    MODIFY_REG(RCC->XTHFCR, RCC_XTHFCR_CFG_Msk, OscilaStrenth);
}

/**
  * @brief    
  * @rmtoll   XTHFCR    CFG    LL_RCC_GetXTHFOscilaStrenth
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_XTHF_OSCILLA_STRENTH_WEAKEST
  *           @arg @ref LL_RCC_XTHF_OSCILLA_STRENTH_STRONGEST
  */
__STATIC_INLINE uint32_t LL_RCC_GetXTHFOscilaStrenth(void)
{
    return (uint32_t)(READ_BIT(RCC->XTHFCR, RCC_XTHFCR_CFG_Msk));
}

/**
  * @brief    
  * @rmtoll   XTHFCR    EN    LL_RCC_XTHF_Enable
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_XTHF_Enable(void)
{
    SET_BIT(RCC->XTHFCR, RCC_XTHFCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   XTHFCR    EN    LL_RCC_XTHF_IsEnabled
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_XTHF_IsEnabled(void)
{
    return (uint32_t)(READ_BIT(RCC->XTHFCR, RCC_XTHFCR_EN_Msk) == RCC_XTHFCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   XTHFCR    EN    LL_RCC_XTHF_Disable
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_XTHF_Disable(void)
{
    CLEAR_BIT(RCC->XTHFCR, RCC_XTHFCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   RCMFCR    PSC    LL_RCC_SetRC4MOutputPrescaler
  * @param    Prescaler This parameter can be one of the following values:
  *           @arg @ref LL_RCC_RC4M_OUTPUT_PRESCALER_DIV1
  *           @arg @ref LL_RCC_RC4M_OUTPUT_PRESCALER_DIV4
  *           @arg @ref LL_RCC_RC4M_OUTPUT_PRESCALER_DIV8
  *           @arg @ref LL_RCC_RC4M_OUTPUT_PRESCALER_DIV16
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetRC4MOutputPrescaler(uint32_t Prescaler)
{
    MODIFY_REG(RCC->RCMFCR, RCC_RCMFCR_PSC_Msk, Prescaler);
}

/**
  * @brief    
  * @rmtoll   RCMFCR    PSC    LL_RCC_GetRC4MOutputPrescaler
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_RC4M_OUTPUT_PRESCALER_DIV1
  *           @arg @ref LL_RCC_RC4M_OUTPUT_PRESCALER_DIV4
  *           @arg @ref LL_RCC_RC4M_OUTPUT_PRESCALER_DIV8
  *           @arg @ref LL_RCC_RC4M_OUTPUT_PRESCALER_DIV16
  */
__STATIC_INLINE uint32_t LL_RCC_GetRC4MOutputPrescaler(void)
{
    return (uint32_t)(READ_BIT(RCC->RCMFCR, RCC_RCMFCR_PSC_Msk));
}

/**
  * @brief    
  * @rmtoll   RCMFCR    EN    LL_RCC_RC4M_Enable
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_RC4M_Enable(void)
{
    SET_BIT(RCC->RCMFCR, RCC_RCMFCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   RCMFCR    EN    LL_RCC_RC4M_IsEnabled
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_RC4M_IsEnabled(void)
{
    return (uint32_t)(READ_BIT(RCC->RCMFCR, RCC_RCMFCR_EN_Msk) == RCC_RCMFCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   RCMFCR    EN    LL_RCC_RC4M_Disable
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_RC4M_Disable(void)
{
    CLEAR_BIT(RCC->RCMFCR, RCC_RCMFCR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   RCHFTR    TRIM    LL_RCC_SetRCHFTrimValue
  * @param    TrimValue TrimValue The value of RCHF trim
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetRCHFTrimValue(uint32_t TrimValue)
{
    MODIFY_REG(RCC->RCHFTR, (0x7FU << 0U), (TrimValue << 0U));
}

/**
  * @brief    
  * @rmtoll   RCHFTR    TRIM    LL_RCC_GetRCHFTrimValue
  * @retval   The value of RCHF trim
  */
__STATIC_INLINE uint32_t LL_RCC_GetRCHFTrimValue(void)
{
    return (uint32_t)(READ_BIT(RCC->RCHFTR, 0x7FU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   PCLKCR1        LL_RCC_Group1_EnableBusClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_BUS1_CLOCK_LPTIM
  *           @arg @ref LL_RCC_BUS1_CLOCK_USB
  *           @arg @ref LL_RCC_BUS1_CLOCK_RTC
  *           @arg @ref LL_RCC_BUS1_CLOCK_PMU
  *           @arg @ref LL_RCC_BUS1_CLOCK_SCU
  *           @arg @ref LL_RCC_BUS1_CLOCK_IWDT
  *           @arg @ref LL_RCC_BUS1_CLOCK_ANAC
  *           @arg @ref LL_RCC_BUS1_CLOCK_GPIO
  *           @arg @ref LL_RCC_BUS1_CLOCK_DCU
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Group1_EnableBusClock(uint32_t Peripheral)
{
    SET_BIT(RCC->PCLKCR1, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PCLKCR2        LL_RCC_Group2_EnableBusClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_BUS2_CLOCK_CRC
  *           @arg @ref LL_RCC_BUS2_CLOCK_RNG
  *           @arg @ref LL_RCC_BUS2_CLOCK_AES
  *           @arg @ref LL_RCC_BUS2_CLOCK_LCD
  *           @arg @ref LL_RCC_BUS2_CLOCK_DMA
  *           @arg @ref LL_RCC_BUS2_CLOCK_FLASH
  *           @arg @ref LL_RCC_BUS2_CLOCK_RAMBIST
  *           @arg @ref LL_RCC_BUS2_CLOCK_WWDT
  *           @arg @ref LL_RCC_BUS2_CLOCK_ADC
  *           @arg @ref LL_RCC_BUS2_CLOCK_HDIV
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Group2_EnableBusClock(uint32_t Peripheral)
{
    SET_BIT(RCC->PCLKCR2, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PCLKCR3        LL_RCC_Group3_EnableBusClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_BUS3_CLOCK_SPI1
  *           @arg @ref LL_RCC_BUS3_CLOCK_SPI2
  *           @arg @ref LL_RCC_BUS3_CLOCK_UART0
  *           @arg @ref LL_RCC_BUS3_CLOCK_UART1
  *           @arg @ref LL_RCC_BUS3_CLOCK_UART4
  *           @arg @ref LL_RCC_BUS3_CLOCK_UART5
  *           @arg @ref LL_RCC_BUS3_CLOCK_UARTIR
  *           @arg @ref LL_RCC_BUS3_CLOCK_LPUART0
  *           @arg @ref LL_RCC_BUS3_CLOCK_U7816
  *           @arg @ref LL_RCC_BUS3_CLOCK_LPUART1
  *           @arg @ref LL_RCC_BUS3_CLOCK_I2C
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Group3_EnableBusClock(uint32_t Peripheral)
{
    SET_BIT(RCC->PCLKCR3, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PCLKCR4        LL_RCC_Group4_EnableBusClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_BUS4_CLOCK_BTIM
  *           @arg @ref LL_RCC_BUS4_CLOCK_GTIM0
  *           @arg @ref LL_RCC_BUS4_CLOCK_GTIM1
  *           @arg @ref LL_RCC_BUS4_CLOCK_ATIM
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Group4_EnableBusClock(uint32_t Peripheral)
{
    SET_BIT(RCC->PCLKCR4, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PCLKCR1        LL_RCC_Group1_DisableBusClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_BUS1_CLOCK_LPTIM
  *           @arg @ref LL_RCC_BUS1_CLOCK_USB
  *           @arg @ref LL_RCC_BUS1_CLOCK_RTC
  *           @arg @ref LL_RCC_BUS1_CLOCK_PMU
  *           @arg @ref LL_RCC_BUS1_CLOCK_SCU
  *           @arg @ref LL_RCC_BUS1_CLOCK_IWDT
  *           @arg @ref LL_RCC_BUS1_CLOCK_ANAC
  *           @arg @ref LL_RCC_BUS1_CLOCK_GPIO
  *           @arg @ref LL_RCC_BUS1_CLOCK_DCU
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Group1_DisableBusClock(uint32_t Peripheral)
{
    CLEAR_BIT(RCC->PCLKCR1, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PCLKCR2        LL_RCC_Group2_DisableBusClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_BUS2_CLOCK_CRC
  *           @arg @ref LL_RCC_BUS2_CLOCK_RNG
  *           @arg @ref LL_RCC_BUS2_CLOCK_AES
  *           @arg @ref LL_RCC_BUS2_CLOCK_LCD
  *           @arg @ref LL_RCC_BUS2_CLOCK_DMA
  *           @arg @ref LL_RCC_BUS2_CLOCK_FLASH
  *           @arg @ref LL_RCC_BUS2_CLOCK_RAMBIST
  *           @arg @ref LL_RCC_BUS2_CLOCK_WWDT
  *           @arg @ref LL_RCC_BUS2_CLOCK_ADC
  *           @arg @ref LL_RCC_BUS2_CLOCK_HDIV
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Group2_DisableBusClock(uint32_t Peripheral)
{
    CLEAR_BIT(RCC->PCLKCR2, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PCLKCR3        LL_RCC_Group3_DisableBusClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_BUS3_CLOCK_SPI1
  *           @arg @ref LL_RCC_BUS3_CLOCK_SPI2
  *           @arg @ref LL_RCC_BUS3_CLOCK_UART0
  *           @arg @ref LL_RCC_BUS3_CLOCK_UART1
  *           @arg @ref LL_RCC_BUS3_CLOCK_UART4
  *           @arg @ref LL_RCC_BUS3_CLOCK_UART5
  *           @arg @ref LL_RCC_BUS3_CLOCK_UARTIR
  *           @arg @ref LL_RCC_BUS3_CLOCK_LPUART0
  *           @arg @ref LL_RCC_BUS3_CLOCK_U7816
  *           @arg @ref LL_RCC_BUS3_CLOCK_LPUART1
  *           @arg @ref LL_RCC_BUS3_CLOCK_I2C
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Group3_DisableBusClock(uint32_t Peripheral)
{
    CLEAR_BIT(RCC->PCLKCR3, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PCLKCR4        LL_RCC_Group4_DisableBusClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_BUS4_CLOCK_BTIM
  *           @arg @ref LL_RCC_BUS4_CLOCK_GTIM0
  *           @arg @ref LL_RCC_BUS4_CLOCK_GTIM1
  *           @arg @ref LL_RCC_BUS4_CLOCK_ATIM
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Group4_DisableBusClock(uint32_t Peripheral)
{
    CLEAR_BIT(RCC->PCLKCR4, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PCLKCR1        LL_RCC_Group1_IsEnabledBusClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_BUS1_CLOCK_LPTIM
  *           @arg @ref LL_RCC_BUS1_CLOCK_USB
  *           @arg @ref LL_RCC_BUS1_CLOCK_RTC
  *           @arg @ref LL_RCC_BUS1_CLOCK_PMU
  *           @arg @ref LL_RCC_BUS1_CLOCK_SCU
  *           @arg @ref LL_RCC_BUS1_CLOCK_IWDT
  *           @arg @ref LL_RCC_BUS1_CLOCK_ANAC
  *           @arg @ref LL_RCC_BUS1_CLOCK_GPIO
  *           @arg @ref LL_RCC_BUS1_CLOCK_DCU
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_Group1_IsEnabledBusClock(uint32_t Peripheral)
{
    return (uint32_t)(READ_BIT(RCC->PCLKCR1, ((Peripheral & 0xFFFFFFFF) << 0x0U)) == ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PCLKCR2        LL_RCC_Group2_IsEnabledBusClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_BUS2_CLOCK_CRC
  *           @arg @ref LL_RCC_BUS2_CLOCK_RNG
  *           @arg @ref LL_RCC_BUS2_CLOCK_AES
  *           @arg @ref LL_RCC_BUS2_CLOCK_LCD
  *           @arg @ref LL_RCC_BUS2_CLOCK_DMA
  *           @arg @ref LL_RCC_BUS2_CLOCK_FLASH
  *           @arg @ref LL_RCC_BUS2_CLOCK_RAMBIST
  *           @arg @ref LL_RCC_BUS2_CLOCK_WWDT
  *           @arg @ref LL_RCC_BUS2_CLOCK_ADC
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_Group2_IsEnabledBusClock(uint32_t Peripheral)
{
    return (uint32_t)(READ_BIT(RCC->PCLKCR2, ((Peripheral & 0xFFFFFFFF) << 0x0U)) == ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PCLKCR3        LL_RCC_Group3_IsEnabledBusClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_BUS3_CLOCK_SPI1
  *           @arg @ref LL_RCC_BUS3_CLOCK_SPI2
  *           @arg @ref LL_RCC_BUS3_CLOCK_UART0
  *           @arg @ref LL_RCC_BUS3_CLOCK_UART1
  *           @arg @ref LL_RCC_BUS3_CLOCK_UART4
  *           @arg @ref LL_RCC_BUS3_CLOCK_UART5
  *           @arg @ref LL_RCC_BUS3_CLOCK_UARTIR
  *           @arg @ref LL_RCC_BUS3_CLOCK_LPUART0
  *           @arg @ref LL_RCC_BUS3_CLOCK_U7816
  *           @arg @ref LL_RCC_BUS3_CLOCK_LPUART1
  *           @arg @ref LL_RCC_BUS3_CLOCK_I2C
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_Group3_IsEnabledBusClock(uint32_t Peripheral)
{
    return (uint32_t)(READ_BIT(RCC->PCLKCR3, ((Peripheral & 0xFFFFFFFF) << 0x0U)) == ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PCLKCR4        LL_RCC_Group4_IsEnabledBusClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_BUS4_CLOCK_BTIM
  *           @arg @ref LL_RCC_BUS4_CLOCK_GTIM0
  *           @arg @ref LL_RCC_BUS4_CLOCK_GTIM1
  *           @arg @ref LL_RCC_BUS4_CLOCK_ATIM
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_Group4_IsEnabledBusClock(uint32_t Peripheral)
{
    return (uint32_t)(READ_BIT(RCC->PCLKCR4, ((Peripheral & 0xFFFFFFFF) << 0x0U)) == ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   OPCCR1        LL_RCC_Group1_EnableOperationClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_EXTI
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_LPUART1
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_LPUART0
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_I2C
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_ATIM
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_UART1
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_UART0
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Group1_EnableOperationClock(uint32_t Peripheral)
{
    SET_BIT(RCC->OPCCR1, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   OPCCR2        LL_RCC_Group2_EnableOperationClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_FLASH_ERASN_PROGRAM
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_RNG
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_ADC
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_LPTIM
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_BSTIM
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Group2_EnableOperationClock(uint32_t Peripheral)
{
    SET_BIT(RCC->OPCCR2, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   OPCCR1        LL_RCC_Group1_DisableOperationClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_EXTI
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_LPUART1
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_LPUART0
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_I2C
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_ATIM
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_UART1
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Group1_DisableOperationClock(uint32_t Peripheral)
{
    CLEAR_BIT(RCC->OPCCR1, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

