xdu-aero-association/FM33LC0XX_Example_0.04/USB HID_Mouse/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_rcc.h
/**
  * @brief    
  * @rmtoll   OPCCR2        LL_RCC_Group2_DisableOperationClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_FLASH_ERASN_PROGRAM
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_RNG
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_ADC
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_LPTIM
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_BSTIM
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_Group2_DisableOperationClock(uint32_t Peripheral)
{
    CLEAR_BIT(RCC->OPCCR2, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   OPCCR1        LL_RCC_Group1_IsEnabledOperationClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_EXTI
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_LPUART1
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_LPUART0
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_I2C
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_ATIM
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_UART1
  *           @arg @ref LL_RCC_OPERATION1_CLOCK_UART0
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_Group1_IsEnabledOperationClock(uint32_t Peripheral)
{
    return (uint32_t)(READ_BIT(RCC->OPCCR1, ((Peripheral & 0xFFFFFFFF) << 0x0U)) == ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   OPCCR2        LL_RCC_Group2_IsEnabledOperationClock
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_FLASH_ERASN_PROGRAM
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_RNG
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_ADC
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_LPTIM
  *           @arg @ref LL_RCC_OPERATION2_CLOCK_BSTIM
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_Group2_IsEnabledOperationClock(uint32_t Peripheral)
{
    return (uint32_t)(READ_BIT(RCC->OPCCR2, ((Peripheral & 0xFFFFFFFF) << 0x0U)) == ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   OPCCR1    EXTICKS    LL_RCC_SetEXTIClockSource
  * @param    EXTISource This parameter can be one of the following values:
  *           @arg @ref LL_RCC_EXTERNAL_INTERRUPT_SAMPLING_CLOCK_SELECT_LSCLK
  *           @arg @ref LL_RCC_EXTERNAL_INTERRUPT_SAMPLING_CLOCK_SELECT_HCLK
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetEXTIClockSource(uint32_t EXTISource)
{
    MODIFY_REG(RCC->OPCCR1, RCC_OPCCR1_EXTICKS_Msk, EXTISource);
}

/**
  * @brief    
  * @rmtoll   OPCCR1    EXTICKS    LL_RCC_GetEXTIClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_EXTERNAL_INTERRUPT_SAMPLING_CLOCK_SELECT_LSCLK
  *           @arg @ref LL_RCC_EXTERNAL_INTERRUPT_SAMPLING_CLOCK_SELECT_HCLK
  */
__STATIC_INLINE uint32_t LL_RCC_GetEXTIClockSource(void)
{
    return (uint32_t)(READ_BIT(RCC->OPCCR1, RCC_OPCCR1_EXTICKS_Msk));
}

/**
  * @brief    
  * @rmtoll   OPCCR1    LPUARTCKS    LL_RCC_SetLPUARTClockSource
  * @param    Uartx This parameter can be one of the following values:
  *           @arg @ref LPUART0
  *           @arg @ref LPUART1
  * @param    LPUART0Source This parameter can be one of the following values:
  *           @arg @ref LL_RCC_LPUART_OPERTION_CLOCK_SOURCE_LSCLK
  *           @arg @ref LL_RCC_LPUART_OPERTION_CLOCK_SOURCE_RCHF
  *           @arg @ref LL_RCC_LPUART_OPERTION_CLOCK_SOURCE_RC4M
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetLPUARTClockSource(LPUART_Type* Uartx,uint32_t Source)
{
    if(Uartx == LPUART0)
    {
        MODIFY_REG(RCC->OPCCR1, RCC_OPCCR1_LPUART0CKS_Msk, Source<<RCC_OPCCR1_LPUART0CKS_Pos);
    }
    else if(Uartx == LPUART1)
    {
        MODIFY_REG(RCC->OPCCR1, RCC_OPCCR1_LPUART1CKS_Msk, Source<<RCC_OPCCR1_LPUART1CKS_Pos);
    }
    
}

/**
  * @brief    
  * @rmtoll   OPCCR1    LPUARTCKS    LL_RCC_GetLPUARTClockSource
  * @param    Uartx This parameter can be one of the following values:
  *           @arg @ref LPUART0
  *           @arg @ref LPUART1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_LPUART_OPERTION_CLOCK_SOURCE_LSCLK
  *           @arg @ref LL_RCC_LPUART_OPERTION_CLOCK_SOURCE_RCHF
  *           @arg @ref LL_RCC_LPUART_OPERTION_CLOCK_SOURCE_RC4M
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPUARTClockSource(LPUART_Type* Uartx)
{
    if(Uartx == LPUART0)
    {
        return (uint32_t)(READ_BIT(RCC->OPCCR1, RCC_OPCCR1_LPUART0CKS_Msk) >>RCC_OPCCR1_LPUART0CKS_Pos );

    }
    else if(Uartx == LPUART1)
    {
        return (uint32_t)(READ_BIT(RCC->OPCCR1, RCC_OPCCR1_LPUART1CKS_Msk) >>RCC_OPCCR1_LPUART1CKS_Pos );
    }
    else
    {
        return 0;
    }
    
}

/**
  * @brief    
  * @rmtoll   OPCCR1    I2CCKS    LL_RCC_SetI2CClockSource
  * @param    I2CSource This parameter can be one of the following values:
  *           @arg @ref LL_RCC_I2C_OPERATION_CLOCK_SOURCE_APBCLK1
  *           @arg @ref LL_RCC_I2C_OPERATION_CLOCK_SOURCE_RCHF
  *           @arg @ref LL_RCC_I2C_OPERATION_CLOCK_SOURCE_SYSCLK
  *           @arg @ref LL_RCC_I2C_OPERATION_CLOCK_SOURCE_RC4M_PSC
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetI2CClockSource(uint32_t I2CSource)
{
    MODIFY_REG(RCC->OPCCR1, RCC_OPCCR1_I2CCKS_Msk, I2CSource);
}

/**
  * @brief    
  * @rmtoll   OPCCR1    I2CCKS    LL_RCC_GetI2CClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_I2C_OPERATION_CLOCK_SOURCE_APBCLK1
  *           @arg @ref LL_RCC_I2C_OPERATION_CLOCK_SOURCE_RCHF
  *           @arg @ref LL_RCC_I2C_OPERATION_CLOCK_SOURCE_SYSCLK
  *           @arg @ref LL_RCC_I2C_OPERATION_CLOCK_SOURCE_RC4M_PSC
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2CClockSource(void)
{
    return (uint32_t)(READ_BIT(RCC->OPCCR1, RCC_OPCCR1_I2CCKS_Msk));
}

/**
  * @brief    
  * @rmtoll   OPCCR1    ATCKS    LL_RCC_SetATIMClockSource
  * @param    ATIMSource This parameter can be one of the following values:
  *           @arg @ref LL_RCC_ATIME_OPERATION_CLOCK_SOURCE_APBCLK2
  *           @arg @ref LL_RCC_ATIME_OPERATION_CLOCK_SOURCE_USBPHYBCK120M
  *           @arg @ref LL_RCC_ATIME_OPERATION_CLOCK_SOURCE_PLLx2
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetATIMClockSource(uint32_t ATIMSource)
{
    MODIFY_REG(RCC->OPCCR1, RCC_OPCCR1_ATCKS_Msk, ATIMSource);
}

/**
  * @brief    
  * @rmtoll   OPCCR1    ATCKS    LL_RCC_GetATIMClockSource
  * @param    ATIMSource This parameter can be one of the following values:
  *           @arg @ref LL_RCC_ATIME_OPERATION_CLOCK_SOURCE_APBCLK2
  *           @arg @ref LL_RCC_ATIME_OPERATION_CLOCK_SOURCE_USBPHYBCK120M
  *           @arg @ref LL_RCC_ATIME_OPERATION_CLOCK_SOURCE_PLLx2
  * @retval   None
  */
__STATIC_INLINE uint32_t LL_RCC_GetATIMClockSource(uint32_t ATIMSource)
{
    return (uint32_t)(READ_BIT(RCC->OPCCR1, RCC_OPCCR1_ATCKS_Msk));
}

/**
  * @brief    
  * @rmtoll   OPCCR1    UARTCKS    LL_RCC_SetUARTClockSource
  * @param    Uartx This parameter can be one of the following values:
  *           @arg @ref UART0
  *           @arg @ref UART1
  * @param    UART1Source This parameter can be one of the following values:
  *           @arg @ref LL_RCC_UART_OPERATION_CLOCK_SOURCE_APBCLK1
  *           @arg @ref LL_RCC_UART_OPERATION_CLOCK_SOURCE_RCHF
  *           @arg @ref LL_RCC_UART_OPERATION_CLOCK_SOURCE_SYSCLK
  *           @arg @ref LL_RCC_UART_OPERATION_CLOCK_SOURCE_RC4M_PSC
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetUARTClockSource(UART_Type* Uartx,uint32_t Source)
{
    if(Uartx == UART0)
    {
        MODIFY_REG(RCC->OPCCR1, RCC_OPCCR1_UART0CKS_Msk, Source<<RCC_OPCCR1_UART0CKS_Pos);
    }
    else if(Uartx == UART1)
    {
        MODIFY_REG(RCC->OPCCR1, RCC_OPCCR1_UART1CKS_Msk, Source<<RCC_OPCCR1_UART1CKS_Pos);
    }
}

/**
  * @brief    
  * @rmtoll   OPCCR1    UART1CKS    LL_RCC_GetUARTClockSource
  * @param    Uartx This parameter can be one of the following values:
  *           @arg @ref UART0
  *           @arg @ref UART1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_UART_OPERATION_CLOCK_SOURCE_APBCLK1
  *           @arg @ref LL_RCC_UART_OPERATION_CLOCK_SOURCE_RCHF
  *           @arg @ref LL_RCC_UART_OPERATION_CLOCK_SOURCE_SYSCLK
  *           @arg @ref LL_RCC_UART_OPERATION_CLOCK_SOURCE_RC4M_PSC
  */
__STATIC_INLINE uint32_t LL_RCC_GetUARTClockSource(UART_Type* Uartx)
{
    if(Uartx == UART0)
    {
        return (uint32_t)(READ_BIT(RCC->OPCCR1, RCC_OPCCR1_UART0CKS_Msk)>>RCC_OPCCR1_UART0CKS_Pos);
    }
    else if(Uartx == UART1)
    {
        return (uint32_t)(READ_BIT(RCC->OPCCR1, RCC_OPCCR1_UART1CKS_Msk)>>RCC_OPCCR1_UART1CKS_Pos); 
    }
    else
    {
        return 0;
    }
}
/**
  * @brief    
  * @rmtoll   OPCCR2    RNGPRSC    LL_RCC_SetRNGPrescaler
  * @param    Prescaler This parameter can be one of the following values:
  *           @arg @ref LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV1
  *           @arg @ref LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV2
  *           @arg @ref LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV4
  *           @arg @ref LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV8
  *           @arg @ref LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV16
  *           @arg @ref LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV32
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetRNGPrescaler(uint32_t Prescaler)
{
    MODIFY_REG(RCC->OPCCR2, RCC_OPCCR2_RNGPRSC_Msk, Prescaler);
}

/**
  * @brief    
  * @rmtoll   OPCCR2    RNGPRSC    LL_RCC_GetRNGPrescaler
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV1
  *           @arg @ref LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV2
  *           @arg @ref LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV4
  *           @arg @ref LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV8
  *           @arg @ref LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV16
  *           @arg @ref LL_RCC_RNG_OPERATION_CLOCK_PRESCALER_DIV32
  */
__STATIC_INLINE uint32_t LL_RCC_GetRNGPrescaler(void)
{
    return (uint32_t)(READ_BIT(RCC->OPCCR2, RCC_OPCCR2_RNGPRSC_Msk));
}

/**
  * @brief    
  * @rmtoll   OPCCR2    ADCPRSC    LL_RCC_SetADCPrescaler
  * @param    Prescaler This parameter can be one of the following values:
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV1
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV2
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV4
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV8
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV16
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV32
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetADCPrescaler(uint32_t Prescaler)
{
    MODIFY_REG(RCC->OPCCR2, RCC_OPCCR2_ADCPRSC_Msk, Prescaler);
}

/**
  * @brief    
  * @rmtoll   OPCCR2    ADCPRSC    LL_RCC_GetADCPrescaler
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV1
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV2
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV4
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV8
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV16
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALER_DIV32
  */
__STATIC_INLINE uint32_t LL_RCC_GetADCPrescaler(void)
{
    return (uint32_t)(READ_BIT(RCC->OPCCR2, RCC_OPCCR2_ADCPRSC_Msk));
}

/**
  * @brief    
  * @rmtoll   OPCCR2    ADCCKS    LL_RCC_SetADCClockSource
  * @param    ADCSource This parameter can be one of the following values:
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALLER_RC4M_PSC
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALLER_RCHF
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALLER_XTHF
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALLER_PLL
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetADCClockSource(uint32_t ADCSource)
{
    MODIFY_REG(RCC->OPCCR2, RCC_OPCCR2_ADCCKS_Msk, ADCSource);
}

/**
  * @brief    
  * @rmtoll   OPCCR2    ADCCKS    LL_RCC_GetADCClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALLER_RC4M_PSC
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALLER_RCHF
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALLER_XTHF
  *           @arg @ref LL_RCC_ADC_OPERATION_CLOCK_PRESCALLER_PLL
  */
__STATIC_INLINE uint32_t LL_RCC_GetADCClockSource(void)
{
    return (uint32_t)(READ_BIT(RCC->OPCCR2, RCC_OPCCR2_ADCCKS_Msk));
}

/**
  * @brief    
  * @rmtoll   OPCCR2    LPTCKS    LL_RCC_SetLPTIMClockSource
  * @param    LPTIMSource This parameter can be one of the following values:
  *           @arg @ref LL_RCC_LPTIM_OPERATION_CLOCK_SOURCE_APBCLK1
  *           @arg @ref LL_RCC_LPTIM_OPERATION_CLOCK_SOURCE_LSCLK
  *           @arg @ref LL_RCC_LPTIM_OPERATION_CLOCK_SOURCE_RCLP
  *           @arg @ref LL_RCC_LPTIM_OPERATION_CLOCK_SOURCE_RC4M_PSC
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetLPTIMClockSource(uint32_t LPTIMSource)
{
    MODIFY_REG(RCC->OPCCR2, RCC_OPCCR2_LPTCKS_Msk, LPTIMSource);
}

/**
  * @brief    
  * @rmtoll   OPCCR2    LPTCKS    LL_RCC_GetLPTIMClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_LPTIM_OPERATION_CLOCK_SOURCE_APBCLK1
  *           @arg @ref LL_RCC_LPTIM_OPERATION_CLOCK_SOURCE_LSCLK
  *           @arg @ref LL_RCC_LPTIM_OPERATION_CLOCK_SOURCE_RCLP
  *           @arg @ref LL_RCC_LPTIM_OPERATION_CLOCK_SOURCE_RC4M_PSC
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIMClockSource(void)
{
    return (uint32_t)(READ_BIT(RCC->OPCCR2, RCC_OPCCR2_LPTCKS_Msk));
}

/**
  * @brief    
  * @rmtoll   OPCCR2    BTCKS    LL_RCC_SetBSTIMClockSource
  * @param    BSTIMSource This parameter can be one of the following values:
  *           @arg @ref LL_RCC_BSTIM_OPERATION_CLK_SOURCE_APBCLK2
  *           @arg @ref LL_RCC_BSTIM_OPERATION_CLK_SOURCE_LSCLK
  *           @arg @ref LL_RCC_BSTIM_OPERATION_CLK_SOURCE_RCLP
  *           @arg @ref LL_RCC_BSTIM_OPERATION_CLK_SOURCE_RC4M_PSC
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetBSTIMClockSource(uint32_t BSTIMSource)
{
    MODIFY_REG(RCC->OPCCR2, RCC_OPCCR2_BTCKS_Msk, BSTIMSource);
}

/**
  * @brief    
  * @rmtoll   OPCCR2    BTCKS    LL_RCC_GetBSTIMClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_BSTIM_OPERATION_CLK_SOURCE_APBCLK2
  *           @arg @ref LL_RCC_BSTIM_OPERATION_CLK_SOURCE_LSCLK
  *           @arg @ref LL_RCC_BSTIM_OPERATION_CLK_SOURCE_RCLP
  *           @arg @ref LL_RCC_BSTIM_OPERATION_CLK_SOURCE_RC4M_PSC
  */
__STATIC_INLINE uint32_t LL_RCC_GetBSTIMClockSource(void)
{
    return (uint32_t)(READ_BIT(RCC->OPCCR2, RCC_OPCCR2_BTCKS_Msk));
}

/**
  * @brief    
  * @rmtoll   AHBMCR    MPRIL    LL_RCC_SetAHBMasterPriority
  * @param    Priority This parameter can be one of the following values:
  *           @arg @ref LL_RCC_AHB_MASTER_PRIORITY_DMA_FIRST
  *           @arg @ref LL_RCC_AHB_MASTER_PRIORITY_CPU_FIRST
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetAHBMasterPriority(uint32_t Priority)
{
    MODIFY_REG(RCC->AHBMCR, RCC_AHBMCR_MPRIL_Msk, Priority);
}

/**
  * @brief    
  * @rmtoll   AHBMCR    MPRIL    LL_RCC_GetAHBMasterPriority
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RCC_AHB_MASTER_PRIORITY_DMA_FIRST
  *           @arg @ref LL_RCC_AHB_MASTER_PRIORITY_CPU_FIRST
  */
__STATIC_INLINE uint32_t LL_RCC_GetAHBMasterPriority(void)
{
    return (uint32_t)(READ_BIT(RCC->AHBMCR, RCC_AHBMCR_MPRIL_Msk));
}

/**
  * @brief    
  * @rmtoll   LSCLKSEL    SEL    LL_RCC_SetLSCLKClockSource
  * @param    Source This parameter can be one of the following values:
  *           @arg @ref LL_RCC_LSCLK_SELECT_RCLP
  *           @arg @ref LL_RCC_LSCLK_SELECT_XTLF
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetLSCLKClockSource(uint32_t Source)
{
    MODIFY_REG(RCC->LSCLKSEL, RCC_LSCLKSEL_SEL_Msk, Source);
}

/**
  * @brief    
  * @rmtoll   LKPCR    RST_EN    LL_RCC_IsEnabledLockUpReset
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledLockUpReset(void)
{
    return (uint32_t)(READ_BIT(RCC->LKPCR, RCC_LKPCR_RST_EN_Msk) == RCC_LKPCR_RST_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   LKPCR    RST_EN    LL_RCC_DisableLockUpReset
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_DisableLockUpReset(void)
{
    CLEAR_BIT(RCC->LKPCR, RCC_LKPCR_RST_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   LKPCR    RST_EN    LL_RCC_EnableLockUpReset
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_EnableLockUpReset(void)
{
    SET_BIT(RCC->LKPCR, RCC_LKPCR_RST_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   SOFTRST        LL_RCC_SetChipReset
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_SetChipReset(void)
{
    WRITE_REG(RCC->SOFTRST,SOFTWARERESET_KEY); 
}

/**
  * @brief    
  * @rmtoll   RSTFR    MDFN_FLAG    LL_RCC_IsActiveFlag_MDFN_FLAG
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_MDFN_FLAG(void)
{
    return (uint32_t)(READ_BIT(RCC->RSTFR, RCC_RSTFR_MDFN_FLAG_Msk) == (RCC_RSTFR_MDFN_FLAG_Msk));
}

/**
  * @brief    
  * @rmtoll   RSTFR    NRSTN_FLAG    LL_RCC_IsActiveFlag_NRSTN_FLAG
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_NRSTN_FLAG(void)
{
    return (uint32_t)(READ_BIT(RCC->RSTFR, RCC_RSTFR_NRSTN_FLAG_Msk) == (RCC_RSTFR_NRSTN_FLAG_Msk));
}

/**
  * @brief    
  * @rmtoll   RSTFR    NRSTN_FLAG    LL_RCC_ClearFlag_NRSTN_FLAG
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_NRSTN_FLAG(void)
{
    WRITE_REG(RCC->RSTFR, RCC_RSTFR_NRSTN_FLAG_Msk);
}

/**
  * @brief    
  * @rmtoll   RSTFR    TESTN_FLAG    LL_RCC_IsActiveFlag_TESTN_FLAG
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_TESTN_FLAG(void)
{
    return (uint32_t)(READ_BIT(RCC->RSTFR, RCC_RSTFR_TESTN_FLAG_Msk) == (RCC_RSTFR_TESTN_FLAG_Msk));
}

/**
  * @brief    
  * @rmtoll   RSTFR    TESTN_FLAG    LL_RCC_ClearFlag_TESTN_FLAG
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_TESTN_FLAG(void)
{
    WRITE_REG(RCC->RSTFR, RCC_RSTFR_TESTN_FLAG_Msk);
}

/**
  * @brief    
  * @rmtoll   RSTFR    PORN_FLAG    LL_RCC_IsActiveFlag_PORN_FLAG
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PORN_FLAG(void)
{
    return (uint32_t)(READ_BIT(RCC->RSTFR, RCC_RSTFR_PORN_FLAG_Msk) == (RCC_RSTFR_PORN_FLAG_Msk));
}

/**
  * @brief    
  * @rmtoll   RSTFR    PORN_FLAG    LL_RCC_ClearFlag_PORN_FLAG
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_PORN_FLAG(void)
{
    WRITE_REG(RCC->RSTFR, RCC_RSTFR_PORN_FLAG_Msk);
}

/**
  * @brief    
  * @rmtoll   RSTFR    PDRN_FLAG    LL_RCC_IsActiveFlag_PDRN_FLAG 
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PDRN_FLAG (void)
{
    return (uint32_t)(READ_BIT(RCC->RSTFR, RCC_RSTFR_PDRN_FLAG_Msk) == (RCC_RSTFR_PDRN_FLAG_Msk));
}

/**
  * @brief    
  * @rmtoll   RSTFR    PDRN_FLAG    LL_RCC_ClearFlag_PDRN_FLAG 
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_PDRN_FLAG (void)
{
    WRITE_REG(RCC->RSTFR, RCC_RSTFR_PDRN_FLAG_Msk);
}

/**
  * @brief    
  * @rmtoll   RSTFR    SOFTN_FLAG    LL_RCC_IsActiveFlag_SOFTN_FLAG
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_SOFTN_FLAG(void)
{
    return (uint32_t)(READ_BIT(RCC->RSTFR, RCC_RSTFR_SOFTN_FLAG_Msk) == (RCC_RSTFR_SOFTN_FLAG_Msk));
}

/**
  * @brief    
  * @rmtoll   RSTFR    SOFTN_FLAG    LL_RCC_ClearFlag_SOFTN_FLAG
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_SOFTN_FLAG(void)
{
    WRITE_REG(RCC->RSTFR, RCC_RSTFR_SOFTN_FLAG_Msk);
}

/**
  * @brief    
  * @rmtoll   RSTFR    IWDTN_FLAG    LL_RCC_IsActiveFlag_IWDTN_FLAG
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_IWDTN_FLAG(void)
{
    return (uint32_t)(READ_BIT(RCC->RSTFR, RCC_RSTFR_IWDTN_FLAG_Msk) == (RCC_RSTFR_IWDTN_FLAG_Msk));
}

/**
  * @brief    
  * @rmtoll   RSTFR    IWDTN_FLAG    LL_RCC_ClearFlag_IWDTN_FLAG
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_IWDTN_FLAG(void)
{
    WRITE_REG(RCC->RSTFR, RCC_RSTFR_IWDTN_FLAG_Msk);
}

/**
  * @brief    
  * @rmtoll   RSTFR    WWDTN_FLAG    LL_RCC_IsActiveFlag_WWDTN_FLAG
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_WWDTN_FLAG(void)
{
    return (uint32_t)(READ_BIT(RCC->RSTFR, RCC_RSTFR_WWDTN_FLAG_Msk) == (RCC_RSTFR_WWDTN_FLAG_Msk));
}

/**
  * @brief    
  * @rmtoll   RSTFR    WWDTN_FLAG    LL_RCC_ClearFlag_WWDTN_FLAG
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_WWDTN_FLAG(void)
{
    WRITE_REG(RCC->RSTFR, RCC_RSTFR_WWDTN_FLAG_Msk);
}

/**
  * @brief    
  * @rmtoll   RSTFR    LKUPN_FLAG    LL_RCC_IsActiveFlag_LKUPN_FLAG
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LKUPN_FLAG(void)
{
    return (uint32_t)(READ_BIT(RCC->RSTFR, RCC_RSTFR_LKUPN_FLAG_Msk) == (RCC_RSTFR_LKUPN_FLAG_Msk));
}

/**
  * @brief    
  * @rmtoll   RSTFR    LKUPN_FLAG    LL_RCC_ClearFlag_LKUPN_FLAG
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LKUPN_FLAG(void)
{
    WRITE_REG(RCC->RSTFR, RCC_RSTFR_LKUPN_FLAG_Msk);
}

/**
  * @brief    
  * @rmtoll   RSTFR    NVICN_FLAG    LL_RCC_IsActiveFlag_NVICN_FLAG
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_NVICN_FLAG(void)
{
    return (uint32_t)(READ_BIT(RCC->RSTFR, RCC_RSTFR_NVICN_FLAG_Msk) == (RCC_RSTFR_NVICN_FLAG_Msk));
}

/**
  * @brief    
  * @rmtoll   RSTFR    NVICN_FLAG    LL_RCC_ClearFlag_NVICN_FLAG
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_NVICN_FLAG(void)
{
    WRITE_REG(RCC->RSTFR, RCC_RSTFR_NVICN_FLAG_Msk);
}

/**
  * @brief    
  * @rmtoll   PRSTEN        LL_RCC_DisablePeripheralReset
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_DisablePeripheralReset(void)
{
    WRITE_REG(RCC->PRSTEN,(~PERHRSTEN_KEY)); 
}

/**
  * @brief    
  * @rmtoll   PRSTEN        LL_RCC_EnablePeripheralReset
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_EnablePeripheralReset(void)
{
    WRITE_REG(RCC->PRSTEN,PERHRSTEN_KEY); 
}

/**
  * @brief    
  * @rmtoll   AHBRSTCR        LL_RCC_EnableResetAHBPeripheral
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_AHB_PERIPHERAL_RST_DMA
  *           @arg @ref LL_RCC_AHB_PERIPHERAL_RST_USB
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_EnableResetAHBPeripheral(uint32_t Peripheral)
{
    SET_BIT(RCC->AHBRSTCR, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   APBRSTCR1        LL_RCC_EnableResetAPB1Peripheral
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_UART5        
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_UART4        
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_GTTIM1       
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_GTTIM0       
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_LCD          
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_U7816        
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_SPI2         
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_LPUART0      
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_IIC         
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_LPTIM 
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_EnableResetAPB1Peripheral(uint32_t Peripheral)
{
    SET_BIT(RCC->APBRSTCR1, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

