xdu-aero-association/FM33LC0XX_Example_0.04/USB HID_Mouse/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_rcc.h
/**
  * @brief    
  * @rmtoll   APBRSTCR2        LL_RCC_EnableResetAPB2Peripheral
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_ATIM
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_BSTIM
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_ADC_CR
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_ADC
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_OPA
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_HDV
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_AES
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_CRC
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_RNG
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_UART1
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_UART0
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_SPI1
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_UCIR
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_LPUART1
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_EnableResetAPB2Peripheral(uint32_t Peripheral)
{
    SET_BIT(RCC->APBRSTCR2, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   AHBRSTCR        LL_RCC_DisableResetAHBPeripheral
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_AHB_PERIPHERAL_RST_DMA
  *           @arg @ref LL_RCC_AHB_PERIPHERAL_RST_USB
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_DisableResetAHBPeripheral(uint32_t Peripheral)
{
    CLEAR_BIT(RCC->AHBRSTCR, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   APBRSTCR1        LL_RCC_DisableResetAPB1Peripheral
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_UART5        
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_UART4        
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_GTTIM1       
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_GTTIM0       
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_LCD          
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_U7816        
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_SPI2         
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_LPUART0      
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_IIC         
  *           @arg @ref LL_RCC_APB1_PERIPHERAL_RST_LPTIM         
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_DisableResetAPB1Peripheral(uint32_t Peripheral)
{
    CLEAR_BIT(RCC->APBRSTCR1, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   APBRSTCR2        LL_RCC_DisableResetAPB2Peripheral
  * @param    Peripheral This parameter can be one of the following values:
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_ATIM
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_BSTIM
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_ADC_CR
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_ADC
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_OPA
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_HDV
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_AES
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_CRC
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_RNG
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_UART1
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_UART0
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_SPI1
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_UCIR
  *           @arg @ref LL_RCC_APB2_PERIPHERAL_RST_LPUART1
  * @retval   None
  */
__STATIC_INLINE void LL_RCC_DisableResetAPB2Peripheral(uint32_t Peripheral)
{
    CLEAR_BIT(RCC->APBRSTCR2, ((Peripheral & 0xFFFFFFFF) << 0x0U));
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
uint32_t LL_RCC_GetPLLClockFreq(void);
uint32_t LL_RCC_GetRCHFClockFreq(void);
uint32_t LL_RCC_GetRC4MClockFreq(void);
uint32_t LL_RCC_GetSystemClockFreq(void);
uint32_t LL_RCC_GetAPB1ClockFreq(uint32_t AHB_Frequency);
uint32_t LL_RCC_GetAPB2ClockFreq(uint32_t AHB_Frequency);
uint32_t LL_RCC_GetAHBClockFreq(uint32_t SYSCLK_Frequency);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_RCC_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-09-16**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
